Repository: 84000/data-translation-memory
Catalog: toh219-v3.tmx
Source language: bo
Languages: en

source: བྱང་ཆུབ་སེམས་དཔའ་གང་དག་ད་ལྟ་ན་སེམས་དང་པོ་བསྐྱེད་པ་དེ་དག་གིས་དང་པོ་བྱང་ཆུབ་མཆོག་ཏུ་སེམས་བསྐྱེད་པ་དང་ལྡན་པའི་དགེ་བའི་རྩ་བ་གང་ལགས་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་བསྐལ་པ་བརྒྱས་བྱུང་བ་རྣམས་ཀྱི་བསོད་ནམས་ཀྱི་ཕུང་པོ་གང་ལགས་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཐོབ་པ་རྣམས་ཀྱི་བསོད་ནམས་ཀྱི་ཕུང་པོ་གང་ལགས་པ་དང་། ཕྱིར་མི་ལྡོག་པ་རྣམས་ཀྱི་བསོད་ནམས་ཀྱི་ཕུང་པོ་གང་ལགས་པ་དང་།
en: “ ‘I rejoice with the greatest joy in all the roots of merit possessed by those bodhisattvas in the present who have first developed the aspiration to enlightenment, in all the accumulations of merit of bodhisattvas during a hundred eons, in all the accumulations of merit of bodhisattvas who have attained patience in the birthlessness of phenomena, in all the accumulations of merit of those who have become irreversible, and in all the accumulations of merit of bodhisattvas who have one life remaining.

source: བྱང་ཆུབ་སེམས་དཔའ་སྐྱེ་བ་གཅིག་གིས་ཐོགས་པ་རྣམས་ཀྱི་བསོད་ནམས་ཀྱི་ཕུང་པོ་གང་ལགས་པ་དེ་དག་ཐམས་ཅད་ལ་ཡང་རྗེས་སུ་ཡི་རང་བའི་མཆོག་གིས་རྗེས་སུ་ཡི་རང་བ་ནས་རྗེས་སུ་ཡི་རང་བ་མི་མཉམ་པ་དང་མཉམ་པའི་བར་གྱིས་རྗེས་སུ་ཡི་རང་ངོ་། །
en: I rejoice in them with joy that is … and so on, until and that has no equal.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་དང་ལྡན་པའི་དགེ་བའི་རྩ་བ་མངོན་པར་འདུས་བགྱིས་པ་གང་ལགས་པ་དེ་དག་ཐམས་ཅད་ལ་ཡང་རྗེས་སུ་ཡི་རང་བའི་མཆོག་གིས་རྗེས་སུ་ཡི་རང་ངོ་། །རྗེས་སུ་ཡི་རང་བའི་དམ་པ་དང་། གཙོ་བོ་དང་། ཁྱད་པར་ཅན་དང་། རབ་དང་། ཕུལ་དང་། གྱ་ནོམ་པ་དང་། བླ་མ་དང་།
en: “ ‘I rejoice with the greatest joy in all the good roots of possessing the six perfections that were produced by the bodhisattva mahāsattvas during their past bodhisattva practice.

source: བླ་ན་མེད་པ་དང་། ལྟག་ན་མེད་པ་དང་། མཉམ་པ་མེད་པ་དང་། མི་མཉམ་པ་དང་མཉམ་པས་རྗེས་སུ་ཡི་རང་ངོ་། །
en: I rejoice in them with a joy that is sublime, preeminent, superior, complete, perfect, excellent, the highest, unsurpassable, none-higher, unequaled, and that has no equal.

source: མ་འོངས་པའི་དུས་ཀྱི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་བྱང་ཆུབ་ཀྱི་ཕྱིར་སྤྱོད་པ་ན་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་དང་ལྡན་པའི་བསོད་ནམས་ཀྱི་ཕུང་པོ་མངོན་པར་འདུ་བགྱིད་པར་འགྱུར་བ་གང་ལགས་པ་དེ་དག་ཐམས་ཅད་ལ་ཡང་རྗེས་སུ་ཡི་རང་བའི་མཆོག་གིས་རྗེས་སུ་ཡི་རང་ངོ་། །རྗེས་སུ་ཡི་རང་བ་དམ་པ་དང་། གཙོ་བོ་དང་། ཁྱད་པར་ཅན་དང་། རབ་དང་། ཕུལ་དང་། གྱ་ནོམ་པ་དང་། བླ་མ་དང་།
en: “ ‘I rejoice with the greatest joy in all the accumulations of merit from possessing the six perfections that will be produced by the bodhisattva mahāsattvas in their bodhisattva practice in the future.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་དག་ད་ལྟར་ཕྱོགས་བཅུའི་འཇིག་རྟེན་ན་བྱང་ཆུབ་ཀྱི་ཕྱིར་སྤྱོད་པ་དེ་དག་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་དང་ལྡན་པའི་བསོད་ནམས་ཀྱི་ཕུང་པོ་མངོན་པར་འདུ་བགྱིད་པ་གང་ལགས་པ་དེ་དག་ཐམས་ཅད་ལ་ཡང་རྗེས་སུ་ཡི་རང་བའི་མཆོག་གིས་རྗེས་སུ་ཡི་རང་ངོ་། །རྗེས་སུ་ཡི་རང་བ་དམ་པ་དང་། གཙོ་བོ་དང་། ཁྱད་པར་ཅན་དང་། རབ་དང་། ཕུལ་དང་། གྱ་ནོམ་པ་དང་། བླ་མ་དང་།
en: “ ‘I rejoice with the greatest joy in all the accumulations of merit from possessing the six perfections that are being produced by the bodhisattva mahāsattvas in their bodhisattva practice in the present.

source: བླ་ན་མེད་པ་དང་། ལྟག་ན་མེད་པ་དང་། མཉམ་པ་མེད་པ་དང་། མི་མཉམ་པ་དང་མཉམ་པས་རྗེས་སུ་ཡི་རང་ངོ་། །སྐྱེ་བོ་མང་པོ་ལ་སྨན་པ་དང་།
en: I rejoice in them with a joy that is sublime, preeminent, superior, complete, perfect, excellent, the highest, unsurpassable, none-higher, unequaled, and that has no equal.

source: སྐྱེ་བོ་མང་པོ་ལ་བདེ་བ་དང་། འཇིག་རྟེན་ལ་ཐུགས་བརྩེ་བ་དང་། སྐྱེ་བོ་ཕལ་པོ་ཆེ་དང་། ལྷ་དང་མི་རྣམས་ཀྱི་དོན་དང་། སྨན་པ་དང་བདེ་བའི་སླད་དུ་སྔོན་གྱི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དེ་དག་གིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་ཆོས་ཀྱི་འཁོར་ལོ་རབ་ཏུ་བསྐོར་བ། ཆོས་ཀྱི་འཁོར་ལོ་རབ་ཏུ་བསྟན་པ། ཆོས་ཀྱི་ཚུལ་རབ་ཏུ་བཟུང་བ། ཆོས་ཀྱི་ཆར་རབ་ཏུ་ཕབ་པ། ཆོས་ཀྱི་ཆར་རབ་ཏུ་བཏང་བ། ཆོས་ཀྱི་རྔ་རབ་ཏུ་བརྡུངས་པ། ཆོས་ཀྱི་རྔ་བོ་ཆེ་བརྡུངས་པ། ཆོས་ཀྱི་དུང་བུས་པ། ཆོས་ཀྱི་སྲོག་ཤིང་བསྒྲེང་བ། ཆོས་ཀྱི་སྒྲོན་མ་འབར་བར་མཛད་པ། སེམས་ཅན་ཐམས་ཅད་ལ་ཆོས་ཀྱི་སྦྱིན་པས་ཚིམ་པར་མཛད་པ། ཉམ་བག་ཏུ་སྤྱོད་དུ་བཙུད་པ་གང་ལགས་པ་དང་། དེ་ལ་ཉན་ཐོས་ཀྱི་ཐེག་པ་པའམ། རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་པའམ། བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་པའམ།
en: “ ‘I rejoice with the greatest joy in the conscientious conduct of the tathāgata arhat samyaksaṃbuddhas of the past, who for the sake of benefit for many beings, for the happiness of many beings, out of compassion for the world, and for the welfare, benefit, and happiness of multitudes of beings, devas and humans, attained the highest, most complete enlightenment of buddhahood; turned the wheel of the Dharma; taught the wheel of the Dharma; possessed the way of the Dharma; gave the gift of the Dharma; lit the lamp of the Dharma; sent down the rain of the Dharma; beat the drum of the Dharma; beat the great drum of the Dharma; blew the conch of the Dharma; raised the central pillar of the Dharma; and brought satisfaction to all beings with the gift of the Dharma, through which roots of merit were generated by beings who entered the Śrāvakayāna, beings who entered the Pratyekabuddhayāna, beings who entered the Bodhisattvayāna, or any other beings.

source: དེ་ལས་གཞན་པའི་སེམས་ཅན་རྣམས་ཀྱིས་དགེ་བའི་རྩ་བ་བསྐྱེད་པ་གང་ལགས་པ་དེ་དག་ཐམས་ཅད་ལ་ཡང་རྗེས་སུ་ཡི་རང་བའི་མཆོག་གིས་རྗེས་སུ་ཡི་རང་བ་ནས་རྗེས་སུ་ཡི་རང་བ་མི་མཉམ་པ་དང་མཉམ་པའི་བར་གྱིས་རྗེས་སུ་ཡི་རང་ངོ་། །སྐྱེ་བོ་མང་པོ་ལ་སྨན་པ་དང་། སྐྱེ་བོ་མང་པོ་ལ་བདེ་བ་དང་།
en: I rejoice in them with a joy that is … and so on, until and that has no equal.

source: འཇིག་རྟེན་ལ་ཐུགས་བརྩེ་བ་དང་། སྐྱེ་བོ་ཕལ་པོ་ཆེ་དང་། ལྷ་དང་མི་རྣམས་ཀྱི་དོན་དང་། སྨན་པ་དང་། བདེ་བའི་སླད་དུ་མ་འོངས་པའི་དུས་ཀྱི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་ཆོས་ཀྱི་འཁོར་ལོ་སྐོར་བར་འགྱུར་བའི་བར་དག་གང་ལགས་པ་དང་། དེ་ལ་ཉན་ཐོས་ཀྱི་ཐེག་པ་པའམ། རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་པའམ། བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་པའམ།
en: “ ‘I rejoice with the greatest joy in the conscientious conduct of the tathāgata arhat samyaksaṃbuddhas of the future, who for the sake of the benefit for many beings, for the happiness of many beings, out of compassion for the world, and for the welfare, benefit, and happiness of multitudes of beings, devas and humans, will attain the highest, most complete enlightenment of buddhahood; turn the wheel of the Dharma; teach the wheel of the Dharma; possess the way of the Dharma; give the gift of the Dharma; light the lamp of the Dharma; send down the rain of the Dharma; beat the drum of the Dharma; beat the great drum of the Dharma; blow the conch of the Dharma; raise the central pillar of the Dharma; and bring satisfaction to all beings with the gift of the Dharma, through which roots of merit will be generated by beings who have entered the Śrāvakayāna, beings who have entered the Pratyekabuddhayāna, beings who have entered the Bodhisattvayāna, or any other beings.

source: དེ་ལས་གཞན་པའི་སེམས་ཅན་དག་དགེ་བའི་རྩ་བ་སྐྱེད་པར་འགྱུར་བ་གང་ལགས་པ་དེ་དག་ཐམས་ཅད་ལ་ཡང་རྗེས་སུ་ཡི་རང་བའི་མཆོག་གིས་རྗེས་སུ་ཡི་རང་བ་ནས་རྗེས་སུ་ཡི་རང་བ་མི་མཉམ་པ་དང་མཉམ་པའི་བར་གྱིས་རྗེས་སུ་ཡི་རང་ངོ་། །སྐྱེ་བོ་མང་པོ་ལ་སྨན་པ་དང་། སྐྱེ་བོ་མང་པོ་ལ་བདེ་བ་དང་།
en: I rejoice in them with a joy that is … and so on, until and that has no equal.

source: འཇིག་རྟེན་ལ་ཐུགས་བརྩེ་བ་དང་། སྐྱེ་བོ་ཕལ་པོ་ཆེ་དང་། ལྷ་དང་མི་རྣམས་ཀྱི་དོན་དང་། སྨན་པ་དང་། བདེ་བའི་སླད་དུ་ད་ལྟར་ན་ཕྱོགས་བཅུའི་འཇིག་རྟེན་ན་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་ཆོས་ཀྱི་འཁོར་ལོ་རབ་ཏུ་བསྐོར་བ། ཆོས་ཀྱི་འཁོར་ལོ་རབ་ཏུ་སྟོན་པ། ཆོས་ཀྱི་ཚུལ་རབ་ཏུ་འཛིན་པ། ཆོས་ཀྱི་ཆར་རབ་ཏུ་འབེབས་པ། ཆོས་ཀྱི་ཆར་རབ་ཏུ་གཏོང་བ། ཆོས་ཀྱི་སྦྱིན་པ་མཛད་པ། ཆོས་ཀྱི་སྒྲོན་མ་འབར་བར་མཛད་པ། ཆོས་ཀྱི་རྔ་རྡུང་བ། ཆོས་ཀྱི་རྔ་བོ་ཆེ་རྡུང་བ། ཆོས་ཀྱི་དུང་འབུད་པ། ཆོས་ཀྱི་སྲོག་ཤིང་སྒྲེང་བ། སེམས་ཅན་ཐམས་ཅད་ལ་ཆོས་ཀྱི་སྦྱིན་པས་ཚིམ་པར་མཛད་པ། ཉམ་བག་ཏུ་སྤྱོད་དུ་འཛུད་པ་གང་ལགས་པ་དང་། དེ་ལ་ཉན་ཐོས་ཀྱི་ཐེག་པ་པའམ། རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་པའམ།
en: “ ‘I rejoice with the greatest joy in the conscientious conduct of the tathāgata arhat samyaksaṃbuddhas of the present time in the worlds of the ten directions, who for the sake of the benefit for many beings, for the happiness of many beings, out of compassion for the world, and for the welfare, benefit, and happiness of multitudes of beings, devas and humans, have attained the highest, most complete enlightenment of buddhahood; turn the wheel of the Dharma; teach the wheel of the Dharma; possess the way of the Dharma; give the gift of the Dharma; light the lamp of the Dharma; send down the rain of the Dharma; beat the drum of the Dharma; beat the great drum of the Dharma; blow the conch of the Dharma; raise the central pillar of the Dharma; and bring satisfaction to all beings with the gift of the Dharma, through which the roots of merit are generated by beings who have entered the Śrāvakayāna, beings who have entered the Pratyekabuddhayāna, beings who have entered the Bodhisattvayāna or any other beings.

source: བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་པའམ། དེ་ལས་གཞན་པའི་སེམས་ཅན་དག་དགེ་བའི་རྩ་བ་བསྐྱེད་པ་གང་ལགས་པ་དེ་དག་ཐམས་ཅད་ལ་ཡང་རྗེས་སུ་ཡི་རང་བའི་མཆོག་གིས་རྗེས་སུ་ཡི་རང་བ་ནས་རྗེས་སུ་ཡི་རང་བ་མི་མཉམ་པ་དང་མཉམ་པའི་བར་གྱིས་རྗེས་སུ་ཡི་རང་ངོ་ཞེས་བརྗོད་པར་བྱའོ། །
en: I rejoice in them with a joy that is … and so on, until and that has no equal.’

source: ཤཱ་རིའི་བུ་འདི་ནི་རྗེས་སུ་ཡི་རང་བའི་བསོད་ནམས་ཀྱི་ཕུང་པོའོ། །
en: “Śāriputra, this is rejoicing’s aggregation of merit.

source: རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་རྗེས་སུ་ཡི་རང་བའི་བསོད་ནམས་ཀྱི་ཕུང་པོ་འདིས་རྗེས་སུ་ཡི་རང་ན་བསོད་ནམས་ཀྱི་ཕུང་པོ་མང་པོ་གྲངས་མེད། དཔག་ཏུ་མེད་པ་སྐྱེད་དོ། །ཤཱ་རིའི་བུ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་སེམས་ཅན་ནས།
en: If a noble son or noble daughter rejoices with this merit from rejoicing, they will generate many incalculable, measureless aggregations of merit.

source: འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་ཀྱི་སེམས་ཅན་ཇི་སྙེད་པ་དེ་དག་ཐམས་ཅད་དགྲ་བཅོམ་པ་ཟག་པ་ཟད་པར་གྱུར་ལ། རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་ལ་ལ་ཞིག་གིས་དེ་དག་ལ་ཇི་སྲིད་འཚོའི་བར་དུ་གོས་དང་། ཟས་དང་། ན་བའི་གསོས་སྨན་དང་། ཡོ་བྱད་རྣམས་ཀྱིས་བསྙེན་བཀུར་བྱས་པ་བས་གང་ཞིག་རྗེས་སུ་ཡི་རང་བ་འདིས་རྗེས་སུ་ཡི་རང་ན་དེ་ནི་དེ་བས་བསོད་ནམས་ཆེས་མང་དུ་གྲངས་མེད་དཔག་ཏུ་མེད་པ་སྐྱེད་དོ། །
en: “Śāriputra, if the beings in not only this trichiliocosm world realm but in as many world realms as there are grains of sand in the Ganges River were all arhats, whose defilements had ceased, and if a noble son or noble daughter were to serve them for as long as they lived with clothing, food, medicines when ill, and other requisites, even then someone who rejoices through this rejoicing would create immeasurably, incalculably greater merit.

source: ཤཱ་རིའི་བུ་དེ་བས་ན་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འདོད་པས་རྗེས་སུ་ཡི་རང་བ་འདིས་རྗེས་སུ་ཡི་རང་བར་བྱའོ། །
en: “Therefore, Śāriputra, a noble son or noble daughter who wishes for the highest, most complete enlightenment of buddhahood should rejoice with this kind of rejoicing.

source: བུད་མེད་སྐྱེས་པའི་དབང་པོ་ཐོབ་པར་འདོད་ཅིང་བུད་མེད་ཀྱི་དབང་པོ་རྗེས་པར་འདོད་པས་ཀྱང་རྗེས་སུ་ཡི་རང་བ་འདིས་རྗེས་སུ་ཡི་རང་བར་བྱའོ། །དེ་སྐད་ཅེས་བཀའ་སྩལ་པ་དང་། བཅོམ་ལྡན་འདས་ལ་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: A woman who wishes to attain a male’s organs, who wishes to exchange her female organs for them, should rejoice with this kind of rejoicing.”

source: བཅོམ་ལྡན་འདས་མ་འོངས་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ལ་སྣང་བ་བགྱིས་པར་འགྱུར་བ་དང་། ད་ལྟར་བྱུང་བའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་མོས་པ་སྐྱེད་པར་འགྱུར་བའི་བསྐུལ་བའི་ཕུང་པོ་བཤད་དུ་གསོལ། དེ་སྐད་ཅེས་གསོལ་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །ཤཱ་རིའི་བུ་འདི་ལ་རིགས་ཀྱི་བུའམ།
en: When the Bhagavat had said that, Venerable Śāriputra said to the Bhagavat, “Bhagavat, I pray that you teach the accumulation of supplications that illuminates the bodhisattva mahāsattvas of the future and gives rise to aspiration in the bodhisattvas of the present.”

source: རིགས་ཀྱི་བུ་མོ་ཉན་ཐོས་ཀྱི་ཐེག་པ་ལ་ཡང་དག་པར་ཞུགས་པའམ། རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་ལ་ཡང་དག་པར་ཞུགས་པའམ། ཐེག་པ་ཆེན་པོ་ལ་ཡང་དག་པར་ཞུགས་པའམ། སེམས་ཅན་གཞན་དག་ཀྱང་རུང་སྟེ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འདོད་པས་ཉིན་ལན་གསུམ་མཚན་ལན་གསུམ་དུ་བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ལ་པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ཏེ། ཐལ་མོ་སྦྱར་ནས་ཚིག་འདི་སྐད་དུ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་གང་དག་ད་ལྟར་ན། ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་ན་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པ་དེ་དག་ལ་ཕྱག་འཚལ་ལོ། །
en: When Venerable Śāriputra had said that, the Bhagavat replied to him, “Śāriputra, a noble son or noble daughter who has entered the Śrāvakayāna, or has entered the Pratyekabuddhayāna, or has entered the Mahāyāna, or any other being who wishes for the highest, most complete enlightenment of buddhahood, should three times each day and three times each night, with the upper robe over one shoulder, kneel on the right knee, place their palms together in homage, and say these words: “ ‘I pay homage to the buddha bhagavats who in this present time in the worlds of the ten directions have attained the highest, most complete enlightenment of buddhahood.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་ལ་ཕྱག་འཚལ་ནས་ཆོས་ཀྱི་འཁོར་ལོ་རབ་ཏུ་བསྐོར་བར་བསྐུལ་གྱིས། སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་གིས་སྐྱེ་བོ་མང་པོ་ལ་སྨན་པ་དང་། སྐྱེ་བོ་མང་པོ་ལ་བདེ་བ་དང་། འཇིག་རྟེན་ལ་ཐུགས་བརྩེ་བ་དང་། སྐྱེ་བོ་ཕལ་པོ་ཆེ་དང་། ལྷ་དང་མི་རྣམས་ཀྱི་དོན་དང་། སྨན་པ་དང་།
en: “ ‘Through my paying homage to those buddha bhagavats, and requesting them to turn the wheel of the Dharma, I pray that those buddha bhagavats, for the sake of benefit for many beings, for the happiness of many beings, out of compassion for the world, and for the welfare, benefit, and happiness of multitudes of beings, devas and humans, turn the wheel of the Dharma.

source: བདེ་བའི་སླད་དུ་ཆོས་ཀྱི་འཁོར་ལོ་རབ་ཏུ་བསྐོར་དུ་གསོལ། །ཆོས་ཀྱི་འཁོར་ལོ་རབ་ཏུ་བསྟན་དུ་གསོལ། །
en: I pray that they teach the wheel of the Dharma.

source: ཆོས་ཀྱི་ཚུལ་རབ་ཏུ་གཟུང་དུ་གསོལ། །
en: I pray that they possess the way of the Dharma.

source: ཆོས་ཀྱི་སྦྱིན་པ་མཛད་པ་གཟུང་དུ་གསོལ། །
en: I pray that they give the gift of the Dharma.

source: ཆོས་ཀྱི་སྒྲོན་མ་འབར་བར་མཛད་དུ་གསོལ། །
en: I pray that they light the lamp of the Dharma.

source: ཆོས་ཀྱི་ཆར་དབབ་ཏུ་གསོལ། །
en: I pray that they send down the rain of the Dharma.

source: ཆོས་ཀྱི་རྔ་བརྡུང་དུ་གསོལ། །
en: I pray that they let fall the rain of the Dharma. I pray that they beat the drum of the Dharma.

source: ཆོས་ཀྱི་རྔ་བོ་ཆེ་བརྡུང་དུ་གསོལ། །
en: I pray that they beat the great drum of the Dharma.

source: ཆོས་ཀྱི་དུང་འབུད་དུ་གསོལ། །
en: I pray that they blow the conch of the Dharma.

source: ཆོས་ཀྱི་སྲོག་ཤིང་བསྒྲེང་དུ་གསོལ་ཞེས་བརྗོད་པར་བྱའོ། །ཤཱ་རིའི་བུ་གཞན་ཡང་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་ཉན་ཐོས་ཀྱི་ཐེག་པ་ལ་ཡང་དག་པར་ཞུགས་པའམ།
en: I pray that they raise the central pillar of the Dharma.’

source: རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་ལ་ཡང་དག་པར་ཞུགས་པའམ། ཐེག་པ་ཆེན་པོ་ལ་ཡང་དག་པར་ཞུགས་པའམ། སེམས་ཅན་གཞན་དག་ཀྱང་རུང་སྟེ། ཉིན་ལན་གསུམ་མཚན་ལན་གསུམ་དུ་བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ལ་པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ཏེ། ཐལ་མོ་སྦྱར་ནས་ཚིག་འདི་སྐད་དུ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་གང་དག་ད་ལྟ་ན་ཕྱོགས་བཅུའི་འཇིག་རྟེན་ན་ཚེའི་འདུ་བྱེད་བཏང་བའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་ལ་ཕྱག་འཚལ་ལོ། །སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་ལ་བདག་ཕྱག་འཚལ་ནས་གསོལ་བ་འདེབས་ཀྱིས། སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་སྐྱེ་བོ་མང་པོ་ལ་སྨན་པ་དང་། སྐྱེ་བོ་མང་པོ་ལ་བདེ་བ་དང་། འཇིག་རྟེན་ལ་ཐུགས་བརྩེ་བ་དང་། སྐྱེ་བོ་ཕལ་པོ་ཆེ་དང་། ལྷ་དང་མི་རྣམས་ཀྱི་དོན་དང་། སྨན་པ་དང་།
en: “Śāriputra, a noble son or noble daughter who has entered the Śrāvakayāna, or has entered the Pratyekabuddhayāna, or has entered the Mahāyāna, or any other being who wishes for the highest, most complete enlightenment of buddhahood, should three times each day and three times each night, with the upper robe over one shoulder, kneel on the right knee, place palms together in homage, and say these words: “ ‘I pay homage to the buddha bhagavats who in this present time in the worlds of the ten directions are giving up their composite life.

source: བདེ་བའི་སླད་དུ་ཆོས་ཀྱི་འཁོར་ལོ་ནི་རབ་ཏུ་བསྐོར། ཆོས་ཀྱི་སྒྲོན་མ་ནི་འབར་བར་མཛད། ཆོས་ཀྱི་ཆར་ནི་རབ་ཏུ་འབེབས། ཆོས་ཀྱི་ཆར་ནི་རབ་ཏུ་གཏོང་། ཆོས་ཀྱི་རྔ་ནི་རབ་ཏུ་རྡུང་། ཆོས་ཀྱི་རྔ་བོ་ཆེ་ནི་རབ་ཏུ་རྡུང་། ཆོས་ཀྱི་དུང་ནི་རབ་ཏུ་འབུད། ཆོས་ཀྱི་སྲོག་ཤིང་ནི་རབ་ཏུ་བསྒྲེང་། ཆོས་ཀྱི་སྒྲོན་མ་ནི་མཆེད་པར་མཛད། སེམས་ཅན་ཐམས་ཅད་ལ་ཆོས་ཀྱི་སྦྱིན་པས་ནི་ཚིམ་པར་མཛད།
en: “ ‘Through my paying homage to those buddha bhagavats, and requesting them to turn the wheel of the Dharma, I pray that those buddha bhagavats, for the sake of benefit for many beings, for the happiness of many beings, out of compassion for the world, and for the welfare, benefit, and happiness of multitudes of beings, devas and humans, turn the wheel of the Dharma, light the lamp of the Dharma, send down the rain of the Dharma, let fall the rain of the Dharma, beat the drum of the Dharma, beat the great drum of the Dharma, blow the conch of the Dharma, raise the central pillar of the Dharma, increase the lamp of the Dharma, and satisfy all beings with the gift of the Dharma.

source: ཉམ་བག་ཏུ་སྤྱོད་དུ་ནི་འཛུད་ཅིང་རེ་ཞིག་བཞུགས་སུ་གསོལ། གསོལ་བ་བཏབ་པའི་ཕུང་པོ་འདི་ཡང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་བསྔོ་སྟེ།
en: “ ‘I also dedicate this accumulation of supplications to the highest, most complete enlightenment.

source: ཇི་ལྟར་ན་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་བསྔོ་བ་དེ་བཞིན་དུ་འདི་ཡོངས་སུ་བསྔོའོ་ཞེས་བརྗོད་པར་བྱའོ། །
en: I dedicate this in such a way that it is dedicated to the highest, most complete enlightenment.’

source: ཤཱ་རིའི་བུ་འདི་ནི་གསོལ་བ་གདབ་པའི་ཕུང་པོ་སྟེ།
en: “Śāriputra, this is the accumulation of supplications.

source: རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་གསོལ་བ་བཏབ་པའི་ཕུང་པོ་འདིས་གསོལ་བ་འདེབས་ན། བསོད་ནམས་མང་པོ་གྲངས་མེད་དཔག་ཏུ་མེད་པ་སྐྱེད་དོ། །
en: If a noble son or noble daughter were to supplicate with this accumulation of supplications, they would create immeasurably, incalculably greater merit than that.

source: ཤཱ་རིའི་བུ་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་གང་ལ་ལ་ཞིག་གིས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ཇི་སྙེད་པ་དེ་དག་རིན་པོ་ཆེ་སྣ་བདུན་གྱིས་བཀང་སྟེ། དེ་བཞིན་གཤེགས་པ་རྣམས་ལ་དབུལ་བ་ཕུལ་བ་བས། གང་གིས་དེ་བཞིན་གཤེགས་པ་དེ་དག་ལ་ཆོས་ཀྱི་འཁོར་ལོ་སྐོར་བར་བསྐུལ་ན་དེ་ནི་དེ་བས་བསོད་ནམས་ཆེས་མང་དུ་གྲངས་མེད་དཔག་ཏུ་མེད་པ་སྐྱེད་དོ། །
en: “Śāriputra, if a noble son or noble daughter were to make an offering to the tathāgatas of the entire trichiliocosm world realm filled with the seven jewels, someone who supplicates the tathāgatas to turn the wheel of the Dharma would create immeasurably, incalculably greater merit than that.

source: ཤཱ་རིའི་བུ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ལྟ་ཞོག་སྟེ། ཤཱ་རིའི་བུ་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་དང་མཉམ་པ་ཇི་སྙེད་པ་དེ་དག་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་ལ་ལ་ཞིག་གིས་རིན་པོ་ཆེ་སྣ་བདུན་གྱིས་བཀང་སྟེ། དེ་བཞིན་གཤེགས་པ་རྣམས་ལ་དབུལ་བ་ཕུལ་བ་བས། གང་གིས་དེ་བཞིན་གཤེགས་པ་དེ་དག་ལ་གསོལ་བ་བཏབ་ན་དེ་ནི་དེ་བས་བསོད་ནམས་ཆེས་མང་དུ་གྲངས་མེད་དཔག་ཏུ་མེད་པ་སྐྱེད་དོ། །
en: “Śāriputra, let alone this trichiliocosm world realm—Śāriputra, if a noble son or noble daughter were to make an offering to the tathāgatas of as many trichiliocosm world realms filled with the seven jewels as there are grains of sand in the Ganges River, still, someone who supplicates the tathāgatas to turn the wheel of the Dharma would create immeasurably, incalculably greater merit than that.

source: ཤཱ་རིའི་བུ་ངས་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན་དེ་བཞིན་གཤེགས་པ་རྣམས་ལ་ཆོས་ཀྱི་འཁོར་ལོ་སྐོར་བར་གསོལ་བ་བཏབ་སྟེ། དགེ་བའི་རྩ་བ་དེས་ན་ང་ལ་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་དང་། མི་མཇེད་ཀྱི་བདག་པོ་ཚངས་པས་བཅོམ་ལྡན་འདས་སྐྱེ་བོ་མང་པོ་ལ་སྨན་པ་དང་། སྐྱེ་བོ་མང་པོ་ལ་བདེ་བ་དང་།
en: Śāriputra, when in the past I was practicing bodhisattva conduct, I supplicated the tathāgatas to turn the wheel of the Dharma.

source: འཇིག་རྟེན་ལ་ཐུགས་བརྩེ་བ་དང་། སྐྱེ་བོ་ཕལ་པོ་ཆེ་དང་། ལྷ་དང་མི་རྣམས་ཀྱི་དོན་དང་། སྨན་པ་དང་། བདེ་བའི་སླད་དུ་ཆོས་ཀྱི་འཁོར་ལོ་རབ་ཏུ་བསྐོར་བར་གསོལ་ཞེས་ཆོས་ཀྱི་འཁོར་ལོ་རབ་ཏུ་བསྐོར་བར་གསོལ་བ་བཏབ་བོ། །
en: It is because of that root of merit that Śakra, the lord of the devas, and Brahmā, the lord of Sahā, supplicated me to turn the wheel of the Dharma, saying, ‘Bhagavat, we pray that you turn the wheel of the Dharma for the sake of benefit for many beings, for the happiness of many beings, out of compassion for the world, and for the welfare, benefit, and happiness of multitudes of beings, devas and humans.’

source: ཤཱ་རིའི་བུ་ངས་སྔོན་བྱང་ཆུབ་ཀྱི་ཕྱིར་སྤྱོད་པ་ན་དེ་བཞིན་གཤེགས་པ་རྣམས་ལ་རིང་དུ་བཞུགས་པར་གསོལ་ཏེ། དགེ་བའི་རྩ་བ་དེས་ན་ང་མི་འཇིགས་པ་བཞི་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་།
en: “Śāriputra, when in the past I was practicing bodhisattva conduct, I prayed that the tathāgatas remain for a long time.

source: སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭ་བརྒྱད་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་ཐོབ་སྟེ། ངའི་དམ་པའི་ཆོས་ཀྱང་ཡུན་རིང་དུ་གནས་པར་འགྱུར་རོ། །དེ་སྐད་ཅེས་བཀའ་སྩལ་པ་དང་། བཅོམ་ལྡན་འདས་ལ་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་ཉན་ཐོས་ཀྱི་ཐེག་པ་ལ་ཡང་དག་པར་ཞུགས་པའམ། རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་ལ་ཡང་དག་པར་ཞུགས་པའམ། ཐེག་པ་ཆེན་པོ་ལ་ཡང་དག་པར་ཞུགས་པའམ། སེམས་ཅན་གཞན་དག་ཀྱང་རུང་སྟེ།
en: It is because of that root of merit that I have attained the four confidences, the ten strengths of the tathāgatas, the eighteen unique qualities of a buddha, the four discernments, great love, great compassion, and complete nirvāṇa, and that my Dharma will remain for a long time.”

source: བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འཚལ་བས་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་འགྱུར་བར་བགྱི་བའི་སླད་དུ་དགེ་བའི་རྩ་བ་རྣམས་ཇི་ལྟར་ཡོངས་སུ་བསྔོ་བར་བགྱི། དེ་སྐད་ཅེས་གསོལ་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །ཤཱ་རིའི་བུ་འདི་ལ་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་ཉན་ཐོས་ཀྱི་ཐེག་པ་ལ་ཡང་དག་པར་ཞུགས་པའམ། རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་ལ་ཡང་དག་པར་ཞུགས་པའམ། ཐེག་པ་ཆེན་པོ་ལ་ཡང་དག་པར་ཞུགས་པའམ།
en: When the Bhagavat had said that, Venerable Śāriputra asked the Bhagavat, “Bhagavat, how should a noble son or noble daughter who has entered the Śrāvakayāna, or has entered the Pratyekabuddhayāna, or has entered the Mahāyāna, or any other being who wishes for the highest, most complete enlightenment of buddhahood, dedicate their roots of merit in order to gain omniscience?”

source: སེམས་ཅན་གཞན་དག་ཀྱང་རུང་སྟེ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འདོད་པས་ཉིན་ལན་གསུམ་དུ་མཚན་ལན་གསུམ་དུ་ཚིག་འདི་སྐད་ཅེས་ཐོག་མ་དང་ཐ་མ་མ་མཆིས་པའི་འཁོར་བ་ན་འཁོར་བའི་ཚེ་བདག་གིས་དགེ་བའི་རྩ་བ་མངོན་པར་འདུས་བགྱིས་པར་གྱུར་པ། སངས་རྒྱས་སམ། ཆོས་སམ། དགེ་འདུན་ནམ། གང་ཟག་གམ། ཐ་ན་དུད་འགྲོའི་སྐྱེ་གནས་སུ་སོང་བ་རྣམས་སམ། སེམས་ཅན་གཞན་དག་ལ་ཡང་རུང་སྟེ། ཟན་ཆང་གཅིག་ཙམ་སྩལ་བར་གྱུར་པ་གང་ལགས་པ་དང་། འཆགས་པ་གང་ལགས་པ་དང་། གསོལ་བ་གདབ་པ་གང་ལགས་པ་དང་། སྐྱབས་སུ་མཆི་བ་གང་ལགས་པ་དང་། བསླབ་པའི་གཞི་དང་ལྡན་པའི་དགེ་བའི་རྩ་བ་གང་ལགས་པ་དང་། སོ་སོར་འཆགས་པ་དང་ལྡན་པའི་དགེ་བའི་རྩ་བ་གང་ལགས་པ་དང་། རྗེས་སུ་ཡི་རང་བ་དང་ལྡན་པའི་བསོད་ནམས་བགྱི་བའི་དངོས་པོ་གང་ལགས་པ་དང་། གསོལ་བ་གདབ་པ་དང་ལྡན་པའི་དགེ་བའི་རྩ་བ་གང་ལགས་པ་དེ་དག་ཐམས་ཅད་གཅིག་ཏུ་བསྡུས་གཞལ་བཟླུམས་ཏེ། སེམས་དུལ་ཞིང་རྣམ་པར་གྲོལ་བ་དང་།
en: When Venerable Śāriputra had asked that, the Bhagavat said to him, “Śāriputra, a noble son or noble daughter who has entered the Śrāvakayāna, or has entered the Pratyekabuddhayāna, or has entered the Mahāyāna, or any other being who wishes for the highest, most complete enlightenment of buddhahood, should three times each day and three times each night say these words: “ ‘Whatever good roots I have created while circling in beginningless and endless saṃsāra—whatever good roots I have from giving even a handful of food to the Buddha, to the Dharma, to the Saṅgha, or even to those reborn as an animal, or to any other being; whatever good roots I have from confession, from supplication, from taking refuge, or from possessing the basis of the training; whatever good roots I have from individual confessions; whatever merit I have from rejoicing; and whatever good roots I have from supplication—I gather them all into one, and with a mind that is tamed, liberated, and without grasping, I bestow all of that together on all beings.
